# Pandas 모듈

In [1]:
import pandas as pd

## 텍스트파일 불러오기

In [2]:
df=pd.read_csv('https://raw.githubusercontent.com/ralbu85/DataSet/master/ch2_data.csv')
df

     Unnamed: 0     TV  Radio  Newspaper  Sales
0             1  230.1   37.8       69.2   22.1
1             2   44.5   39.3       45.1   10.4
2             3   17.2   45.9       69.3    9.3
3             4  151.5   41.3       58.5   18.5
4             5  180.8   10.8       58.4   12.9
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[200 rows x 5 columns]

## 데이터 첫부분 확인

In [3]:
df.head()

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3
3           4  151.5   41.3       58.5   18.5
4           5  180.8   10.8       58.4   12.9

## 열선택

In [4]:
df['TV']

0      230.1
1       44.5
2       17.2
3      151.5
4      180.8
       ...
195     38.2
196     94.2
197    177.0
198    283.6
199    232.1
Name: TV, Length: 200, dtype: float64

In [5]:
df['Radio']

0      37.8
1      39.3
2      45.9
3      41.3
4      10.8
       ...
195     3.7
196     4.9
197     9.3
198    42.0
199     8.6
Name: Radio, Length: 200, dtype: float64

In [6]:
df[['TV','Radio']]

        TV  Radio
0    230.1   37.8
1     44.5   39.3
2     17.2   45.9
3    151.5   41.3
4    180.8   10.8
..     ...    ...
195   38.2    3.7
196   94.2    4.9
197  177.0    9.3
198  283.6   42.0
199  232.1    8.6

[200 rows x 2 columns]

## 선택된 데이터를 새로운 데이터프레임에 저장

In [7]:
df2=df[['TV','Radio','Newspaper','Sales']]
df2

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

## iloc 활용 행선택(i번째 행)

In [8]:
df.iloc[0]

Unnamed: 0      1.0
TV            230.1
Radio          37.8
Newspaper      69.2
Sales          22.1
Name: 0, dtype: float64

In [9]:
df.iloc[1]

Unnamed: 0     2.0
TV            44.5
Radio         39.3
Newspaper     45.1
Sales         10.4
Name: 1, dtype: float64

In [10]:
df.iloc[0:3]

   Unnamed: 0     TV  Radio  Newspaper  Sales
0           1  230.1   37.8       69.2   22.1
1           2   44.5   39.3       45.1   10.4
2           3   17.2   45.9       69.3    9.3

In [11]:
df.iloc[100:]

     Unnamed: 0     TV  Radio  Newspaper  Sales
100         101  222.4    4.3       49.8   11.7
101         102  296.4   36.3      100.9   23.8
102         103  280.2   10.1       21.4   14.8
103         104  187.9   17.2       17.9   14.7
104         105  238.2   34.3        5.3   20.7
..          ...    ...    ...        ...    ...
195         196   38.2    3.7       13.8    7.6
196         197   94.2    4.9        8.1    9.7
197         198  177.0    9.3        6.4   12.8
198         199  283.6   42.0       66.2   25.5
199         200  232.1    8.6        8.7   13.4

[100 rows x 5 columns]

## iloc 활용 열선택

In [12]:
df.iloc[:,0]

0        1
1        2
2        3
3        4
4        5
      ...
195    196
196    197
197    198
198    199
199    200
Name: Unnamed: 0, Length: 200, dtype: int64

In [13]:
df.iloc[:,1]

0      230.1
1       44.5
2       17.2
3      151.5
4      180.8
       ...
195     38.2
196     94.2
197    177.0
198    283.6
199    232.1
Name: TV, Length: 200, dtype: float64

In [14]:
df.iloc[:,1:]

        TV  Radio  Newspaper  Sales
0    230.1   37.8       69.2   22.1
1     44.5   39.3       45.1   10.4
2     17.2   45.9       69.3    9.3
3    151.5   41.3       58.5   18.5
4    180.8   10.8       58.4   12.9
..     ...    ...        ...    ...
195   38.2    3.7       13.8    7.6
196   94.2    4.9        8.1    9.7
197  177.0    9.3        6.4   12.8
198  283.6   42.0       66.2   25.5
199  232.1    8.6        8.7   13.4

[200 rows x 4 columns]

## 데이터 사칙연산

In [15]:
df['TV']+10

0      240.1
1       54.5
2       27.2
3      161.5
4      190.8
       ...
195     48.2
196    104.2
197    187.0
198    293.6
199    242.1
Name: TV, Length: 200, dtype: float64

In [16]:
df['TV']*2

0      460.2
1       89.0
2       34.4
3      303.0
4      361.6
       ...
195     76.4
196    188.4
197    354.0
198    567.2
199    464.2
Name: TV, Length: 200, dtype: float64

In [17]:
df['Radio']+df['TV']

0      267.9
1       83.8
2       63.1
3      192.8
4      191.6
       ...
195     41.9
196     99.1
197    186.3
198    325.6
199    240.7
Length: 200, dtype: float64